
#include "function.h"

/*Вывести двоичное представление целого положительного числа,
используя битовые операции (число вводится с клавиатуры). */

int main() {
  printf("Задание №1\n");
  int val = input();

  print_u_bit(val);

  return 0;
}